JessePham/CMPE146_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
// Lab 08 I2C

#if 1

#if 0
#include "delay.h"
#include "gpio.h"
#include "i2c.h"
#include "i2c_slave_functions.h"
#include "i2c_slave_init.h"
#include <stdbool.h>
#include <stdio.h>

static volatile uint8_t slave_memory[256];

bool i2c_slave_callback__read_memory(uint8_t memory_index, uint8_t *memory) {
  *memory = slave_memory[memory_index];

  return ((slave_memory[memory_index] == *memory) ? true : false);
}

bool i2c_slave_callback__write_memory(uint8_t memory_index, uint8_t memory_value) {
  slave_memory[memory_index] = memory_value;

  return ((memory_value = slave_memory[memory_index]) ? true : false);
}

void turn_on_an_led() { LPC_GPIO2->PIN &= ~(1 << 3); }

void turn_off_an_led() { LPC_GPIO2->PIN |= (1 << 3); }

int main(void) {
  i2c2__slave_init(0x86);

  LPC_IOCON->P2_3 = 0;
  LPC_GPIO2->DIR |= (1 << 3);

  printf("Starting!\n");
  while (1) {
    delay__ms(500);
    if (slave_memory[0] == 0) {
      turn_on_an_led(); // TODO
    } else {
      turn_off_an_led(); // TODO
    }

  return -1;
}
#endif

#if 0
#include "FreeRTOS.h"
#include "cli_handlers.h"
#include "delay.h"
#include "gpio.h"
#include "i2c.h"
#include "i2c_slave_functions.h"
#include "i2c_slave_init.h"
#include "sj2_cli.h"
#include "stdio.h"
#include "task.h"
#include <stdbool.h>

static volatile uint8_t slave_memory[256];

bool i2c_slave_callback__read_memory(uint8_t memory_index, uint8_t *memory) {
  *memory = slave_memory[memory_index];

  printf("\nValue from callback: %i\n", slave_memory[memory_index]);

  return ((slave_memory[memory_index] == *memory) ? true : false);
}

bool i2c_slave_callback__write_memory(uint8_t memory_index, uint8_t memory_value) {
  slave_memory[memory_index] = memory_value;

  return ((memory_value = slave_memory[memory_index]) ? true : false);
}

void test_function(void *p) {
  while (1) {
  }
}

int main(void) {
  sj2_cli__init();

  xTaskCreate(test_function, "test", 4096 / sizeof(void *), NULL, PRIORITY_MEDIUM, NULL);

  vTaskStartScheduler();

  return -1;
}
#endif

/*
// Slave Code
#include "FreeRTOS.h"
#include "gpio.h"
#include "i2c_slave_init.h"
#include "stdint.h"
#include "task.h"

#define SLAVE_ADDRESS 0x20

void main(void) {
  // Set I2C SDA Pin
  gpio__construct_with_function(GPIO__PORT_0, 10, GPIO__FUNCTION_2);
  // Set I2C SCL Pin
  gpio__construct_with_function(GPIO__PORT_0, 11, GPIO__FUNCTION_2);

  i2c2__slave_init(SLAVE_ADDRESS);

  vTaskStartScheduler();
}*/

/*
// Master Code
#include "FreeRTOS.h"
#include "gpio.h"
#include "i2c_slave_init.h"
#include "stdint.h"
#include "task.h"

#define SLAVE_ADDRESS 0x20

void main(void) {
  // Set I2C SDA Pin
  gpio__construct_with_function(GPIO__PORT_0, 10, GPIO__FUNCTION_2);
  // Set I2C SCL Pin
  gpio__construct_with_function(GPIO__PORT_0, 11, GPIO__FUNCTION_2);

  vTaskStartScheduler();
}
*/

#endif

// Lab 07 Watchdogs
#if 0

#include "FreeRTOS.h"
#include "acceleration.h"
#include "cli_handlers.h"
#include "event_groups.h"
#include "ff.h"
#include "queue.h"
#include "sj2_cli.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

static QueueHandle_t sensor_queue;
static EventGroupHandle_t xCreatedEventGroup;
static EventBits_t uxBits;
TaskHandle_t task1;
TaskHandle_t task2;
#define BIT_1 (1 << 1)
#define BIT_2 (1 << 2)

void write_file_using_fatfs_pi(acceleration__axis_data_s *data) {
  const char *filename = "file.txt";
  FIL file; // File handle
  UINT bytes_written = 0;
  FRESULT result = f_open(&file, filename, (FA_WRITE | FA_OPEN_APPEND));

  if (FR_OK == result) {
    char string[64];
    sprintf(string, "%li, %i, %i, %i\n", xTaskGetTickCount(), data->x, data->y, data->z);
    if (FR_OK == f_write(&file, string, strlen(string), &bytes_written)) {
    } else {
      printf("ERROR: Failed to write data to file\n");
    }
    f_close(&file);
  } else {
    printf("ERROR: Failed to open: %s\n", filename);
  }
}

void watchdog_task(void *params) {
  while (1) {

    uxBits = xEventGroupWaitBits(xCreatedEventGroup, BIT_1 | BIT_2, pdTRUE, pdTRUE, 210);
    if ((uxBits & (BIT_1 | BIT_2)) == (BIT_1 | BIT_2)) {
      printf("Verified!\n");
    } else if ((uxBits & BIT_1) == 0 && (uxBits & BIT_2) != 0) {
      printf("Producer Task Failed to Check In!\n");
    } else if ((uxBits & BIT_2) == 0 && (uxBits & BIT_1) != 0) {
      printf("Consumer Task Failed to Check In!\n");
    } else {
      printf("Error with both tasks!\n");
    }
  }
}

void producer_task(void *p) {
  acceleration__axis_data_s temp;
  acceleration__axis_data_s calculated_average;
  while (1) {
    for (int i = 0; i < 100; i++) {
      temp = acceleration__get_data();
      calculated_average.x += temp.x;
      calculated_average.y += temp.y;
      calculated_average.z += temp.z;
      vTaskDelay(1);
    }
    calculated_average.x = calculated_average.x / 100;
    calculated_average.y = calculated_average.y / 100;
    calculated_average.z = calculated_average.z / 100;

    if (xQueueSend(sensor_queue, &calculated_average, 0)) {
      uxBits = xEventGroupSetBits(xCreatedEventGroup, BIT_1);
      vTaskDelay(100);
    }
  }
}

void consumer_task(void *p) {
  acceleration__axis_data_s acceleration_value;

  while (1) {
    if (xQueueReceive(sensor_queue, &acceleration_value, portMAX_DELAY)) {
      printf("%li, %i, %i, %i\n", xTaskGetTickCount(), acceleration_value.x, acceleration_value.y,
             acceleration_value.z);
      write_file_using_fatfs_pi(&acceleration_value);

      uxBits = xEventGroupSetBits(xCreatedEventGroup, BIT_2);
    }
  }
}

void main(void) {
  sensor_queue = xQueueCreate(1, sizeof(acceleration__axis_data_s));
  xCreatedEventGroup = xEventGroupCreate();

  acceleration__init();
  sj2_cli__init();

  xTaskCreate(producer_task, "Producer", 4096 / sizeof(void *), NULL, PRIORITY_MEDIUM, &task1);
  xTaskCreate(consumer_task, "Consumer", 4096 / sizeof(void *), NULL, PRIORITY_MEDIUM, &task2);
  xTaskCreate(watchdog_task, "Watchdog", 4096 / sizeof(void *), NULL, PRIORITY_HIGH, NULL);

  vTaskStartScheduler();
}

#endif

/*================== Homework Assignment FreeRTOS Producer and Consumer Tasks  ==================*/
/*
Explanation of Observations:
1. Use higher priority for producer task, and note down the order of the print-outs
  - The producer task starts with "Sending..." and then "0 Sent!"
  - The consumer task then starts "Receiving..." and then "0 Received!"
  - The producer is still on Delay of 1000ms, so consumer task starts again with "Receiving..."
  - Nothing is in queue, so consumer sleeps.
  - Producer wakes up and does "Sending..." and "1 Sent!" and goes to sleep for 1000ms
  - Consumer wakes up and continues where it left off, so obtains from queue and prints "1 Received"

2. Use higher priority for consumer task, and note down the order of the print-outs
  - Consumer task starts with "Receiving..."
    - Goes to sleep due to empty queue
  - Producer task sends item to queue and prints "Sending..."
    - Switches context to Consumer because Producer has Lower Precedence
  - Consumer wakes up because there is item in queue and prints " 0 Received!"
  - Consumer still has priority, so reruns task and prints "Receiving..."
  - Consumer goes to sleep due to empty queue
    - Context switches to Producer due to Consumer task sleeping
  - Producer starts where it left off and prints "0 Sent!"
    - Due to Consumer still sleeping, Producer rereuns task
  - Producer sends item to queue and prints "Sending..."
  - Consumer wakes up and runs its task
  - Repeats

