JessePham/CMPE146_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
3. Use same priority level for both tasks, and note down the order of the print-outs
  - Consumer prints "Receiving..." and sleeps due to empty queue
  - Producer prints "Sending..." and sends item to queue
  - Producer prints "0 Sent!"
  - Consumer then prints "0 Received!" and reruns task
  - Consumer prints "Receiving..." and sleeps due to empty queue
  - Repeats

Additional Questions:
1.  The purpose of the block time during xQueueReceive() is to allow the producer function to send an item into the
queue if the producer function is of lower priority. It essentially allows the CPU to service other tasks while the
current task is waiting for something to appear in the queue.

2.	If we used the value 0 for the block time during xQueueReceive(), then the producer function will never be able
to run if it is of lower priority than the consumer, thus starved. Once it finds out that there is no item in the queue,
it will rerun its task once again in a continuous loop until there is an item in the queue, however, using our first
example from Figure 1, since the producer function is of lower priority, it will never have a chance to send an item to
the queue.

*/
#if 0

#include "FreeRTOS.h"
#include "cli_handlers.h"
#include "gpio.h"
#include "queue.h"
#include "sj2_cli.h"
#include <stdio.h>
#include <stdlib.h>

static QueueHandle_t switch_queue;

typedef enum { switch__off, switch__on } switch_e;

switch_e get_switch_input_from_switch0() {
  switch_e status = switch__off;

  if (LPC_GPIO1->PIN & (1 << 19)) {
    status = switch__on;
  }

  return status;
}

void producer(void *p) {
  while (1) {
    const switch_e switch_value = get_switch_input_from_switch0();

    printf("\nSending...\n");
    if (xQueueSend(switch_queue, &switch_value, 0)) {
      printf("\n%i Sent!\n", switch_value);
    }

    vTaskDelay(1000);
  }
}

void consumer(void *p) {
  switch_e switch_value;
  while (1) {
    printf("\nReceiving...\n");
    if (xQueueReceive(switch_queue, &switch_value, portMAX_DELAY)) {
      printf("\n%i Received!\n", switch_value);
    }
  }
}

void configure_switch() {
  gpio__construct_with_function(GPIO__PORT_1, 19, GPIO__FUNCITON_0_IO_PINgpio);
  LPC_GPIO1->DIR &= ~(1 << 19);
  LPC_IOCON->P1_19 &= ~(3 << 3);
  LPC_IOCON->P1_19 |= (1 << 3);
}

void main(void) {
  configure_switch();
  sj2_cli__init();

  xTaskCreate(producer, "Producer", 4096 / sizeof(void *), NULL, PRIORITY_HIGH, NULL);
  xTaskCreate(consumer, "Consumer", 4096 / sizeof(void *), NULL, PRIORITY_HIGH, NULL);

  // TODO Queue handle is not valid until you create it
  switch_queue =
      xQueueCreate(1, sizeof(switch_e)); // Choose depth of item being our enum (1 should be okay for this example)

  vTaskStartScheduler();
}

#endif

/*================== Lab 06 UART  ==================*/
#if 0
// Lab 6.3
#include "FreeRTOS.h"
#include "clock.h"
#include "gpio.h"
#include "stdlib.h"
#include "task.h"
#include "uart_lab.h"
#include <string.h>

void board_2_receiver_task(void *p) {
  char number_as_string[16] = {0};
  int counter = 0;

  while (true) {
    char byte = 0;
    uart_lab__get_char_from_queue(&byte, portMAX_DELAY);
    printf("Received: %c\n", byte);

    // This is the last char, so print the number
    if ('\0' == byte) {
      number_as_string[counter] = '\0';
      counter = 0;
      printf("Received this number from the other board: %s\n", number_as_string);
    }
    // We have not yet received the NULL '\0' char, so buffer the data
    else {
      number_as_string[counter] = byte;
      counter = counter + 1;
      // TODO: Store data to number_as_string[] array one char at a time
      // Hint: Use counter as an index, and increment it as long as we do not reach max value of 16
    }
  }
}

void uart_io_init(void) {
  // Transmitter
  gpio__construct_with_function(4, 28, GPIO__FUNCTION_2);
  // Receiver
  gpio__construct_with_function(4, 29, GPIO__FUNCTION_2);
}

void main(void) {
  // TODO: Use uart_lab__init() function and initialize UART2 or UART3 (your choice)
  // TODO: Pin Configure IO pins to perform UART2/UART3 function
  uart_io_init();
  uart_lab__init(UART_3, clock__get_core_clock_hz(), 115200);
  uart__enable_receive_interrupt(UART_3);

  xTaskCreate(board_2_receiver_task, "UART_RECEIVER", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);

  vTaskStartScheduler();
}
#endif

#if 0
// Lab 6.3 THIS IS THINGS THAT WE DIDN'T TURN IN, BUT THE ONE ABOVE IS THE ONE I WILL TURN IN
#include "FreeRTOS.h"
#include "clock.h"
#include "gpio.h"
#include "stdlib.h"
#include "task.h"
#include "uart_lab.h"
#include <string.h>

// This task is done for you, but you should understand what this code is doing
/*void board_1_sender_task(void *p) {
  char number_as_string[16] = {0};

  while (true) {
    const int number = rand();
    sprintf(number_as_string, "%i", number);

    // Send one char at a time to the other board including terminating NULL char
    for (int i = 0; i <= strlen(number_as_string); i++) {
      uart_lab__polled_put(UART_3, number_as_string[i]);
      printf("Sent: %c\n", number_as_string[i]);
    }

    printf("Sent: %i over UART to the other board\n", number);
    vTaskDelay(3000);
  }
}*/

void board_2_receiver_task(void *p) {
  char number_as_string[16] = {0};
  int counter = 0;

  while (true) {
    char byte = 0;
    uart_lab__get_char_from_queue(&byte, portMAX_DELAY);
    printf("Received: %c\n", byte);

    // This is the last char, so print the number
    if ('\0' == byte) {
      number_as_string[counter] = '\0';
      counter = 0;
      printf("Received this number from the other board: %s\n", number_as_string);
    }
    // We have not yet received the NULL '\0' char, so buffer the data
    else {
      number_as_string[counter] = byte;
      counter = counter + 1;
      // TODO: Store data to number_as_string[] array one char at a time
      // Hint: Use counter as an index, and increment it as long as we do not reach max value of 16
    }
  }
}

void uart_io_init(void) {
  // Transmitter
  gpio__construct_with_function(4, 28, GPIO__FUNCTION_2);
  // Receiver
  gpio__construct_with_function(4, 29, GPIO__FUNCTION_2);
}

void main(void) {
  // TODO: Use uart_lab__init() function and initialize UART2 or UART3 (your choice)
  // TODO: Pin Configure IO pins to perform UART2/UART3 function
  uart_io_init();
  uart_lab__init(UART_3, clock__get_core_clock_hz(), 115200);
  uart__enable_receive_interrupt(UART_3);

