JessePham/CMPE146_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
  // xTaskCreate(board_1_sender_task, "UART_SENDER", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  xTaskCreate(board_2_receiver_task, "UART_RECEIVER", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);

  vTaskStartScheduler();
}

/*
void uart_read_task(void *p) {
  char ch_in;
  while (1) {
    // TODO: Use uart_lab__polled_get() function and printf the received value
    if (uart_lab__get_char_from_queue(&ch_in, portMAX_DELAY)) {
      printf("Received Character: %c", ch_in);
    }
  }
}

void uart_write_task(void *p) {
  while (1) {
    // TODO: Use uart_lab__polled_put() function and send a value
    if (uart_lab__polled_put(UART_3, 'f')) {
      printf("\nSent!\n");
    }
    vTaskDelay(500);
  }
}*/
#endif

/*================== Lab 05 SPI Flash Interface ==================*/
#if 0
#include "FreeRTOS.h"
#include "delay.h"
#include "gpio.h"
#include "semphr.h"
#include "spi.h"
#include "task.h"
#include <stdio.h>

SemaphoreHandle_t spi_bus_mutex;

typedef struct {
  uint8_t manufacturer_id;
  uint8_t device_id_1;
  uint8_t device_id_2;
  uint8_t extended_device_id;
} adesto_flash_id_s;

void adesto_cs(void) {
  LPC_GPIO1->PIN &= ~(1 << 10); // Set *CS LOW
  LPC_GPIO2->PIN &= ~(1 << 0);
}

void adesto_ds(void) {
  LPC_GPIO1->PIN |= (1 << 10); // Set *CS HIGH
  LPC_GPIO2->PIN |= (1 << 0);
}

adesto_flash_id_s adesto_read_signature(void) {
  adesto_flash_id_s data = {0};
  if (xSemaphoreTake(spi_bus_mutex, 1000)) {
    adesto_cs();
    LPC_SSP2->DR = spi__exchange_byte(0x9F); // Sending the Opcode
    data.manufacturer_id = spi__exchange_byte(0xFF);
    data.device_id_1 = spi__exchange_byte(0xFF);
    data.device_id_2 = spi__exchange_byte(0xFF);
    data.extended_device_id = LPC_SSP2->DR;
    printf("\n\n%x, %x, %x, %x\n", data.manufacturer_id, data.device_id_1, data.device_id_2, data.extended_device_id);
    adesto_ds();
    xSemaphoreGive(spi_bus_mutex);
  }
  return data;
}

void spi_pin_configuration(void) {
  // Setting up SCK
  gpio__construct_with_function(GPIO__PORT_1, 0, GPIO__FUNCTION_4);
  // Setting up MOSI
  gpio__construct_with_function(GPIO__PORT_1, 1, GPIO__FUNCTION_4);
  // Setting up MISO
  gpio__construct_with_function(GPIO__PORT_1, 4, GPIO__FUNCTION_4);
  // Setting up *CS
  gpio__construct_with_function(GPIO__PORT_1, 10, GPIO__FUNCITON_0_IO_PIN);
  gpio__construct_as_output(GPIO__PORT_1, 10);

  // Fake *CS
  gpio__construct_with_function(GPIO__PORT_2, 0, GPIO__FUNCITON_0_IO_PIN);
  gpio__construct_as_output(GPIO__PORT_2, 0);
}

void spi_id_verification_task(void *p) {
  while (1) {
    const adesto_flash_id_s id = adesto_read_signature();
    // When we read a manufacturer ID we do not expect, we will kill this task
    if (id.manufacturer_id != 0x1F) {
      fprintf(stderr, "Manufacturer ID read failure\n");
      vTaskSuspend(NULL); // Kill this task
    }
  }
}

void main(void) {
  // TODO: Initialize your SPI, its pins, Adesto flash CS GPIO etc...
  const uint32_t spi_clock_mhz = 24;
  spi__init(spi_clock_mhz);
  spi_pin_configuration();

  spi_bus_mutex = xSemaphoreCreateMutex();

  // Create two tasks that will continously read signature
  xTaskCreate(spi_id_verification_task, "SPI_ID_TASK1", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  xTaskCreate(spi_id_verification_task, "SPI_ID_TASK2", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);

  vTaskStartScheduler();
}
#endif
#if 0
// Lab 5.1
#include "FreeRTOS.h"
#include "gpio.h"
#include "spi.h"
#include "task.h"
#include <stdio.h>

// TODO: Implement Adesto flash memory CS signal as a GPIO driver
void adesto_cs(void);
void adesto_ds(void);

// TODO: Study the Adesto flash 'Manufacturer and Device ID' section
typedef struct {
  uint8_t manufacturer_id;
  uint8_t device_id_1;
  uint8_t device_id_2;
  uint8_t extended_device_id;
} adesto_flash_id_s;

void adesto_cs(void) {
  LPC_GPIO1->PIN &= ~(1 << 10); // Set *CS LOW
  LPC_GPIO2->PIN &= ~(1 << 0);
}

void adesto_ds(void) {
  LPC_GPIO1->PIN |= (1 << 10); // Set *CS HIGH
  LPC_GPIO2->PIN |= (1 << 0);
}

// TODO: Implement the code to read Adesto flash memory signature
// TODO: Create struct of type 'adesto_flash_id_s' and return it
adesto_flash_id_s adesto_read_signature(void) {
  adesto_flash_id_s data = {0};

  adesto_cs();
  spi__exchange_byte(0x9F); // Sending the Opcode
  data.manufacturer_id = spi__exchange_byte(0xFF);
  data.device_id_1 = spi__exchange_byte(0xFF);
  data.device_id_2 = spi__exchange_byte(0xFF);
  data.extended_device_id = spi__exchange_byte(0xFF);
  adesto_ds();

  return data;
}

void todo_configure_your_spi_pin_functions(void) {
  // Setting up SCK
  gpio__construct_with_function(GPIO__PORT_1, 0, GPIO__FUNCTION_4);
  // Setting up MOSI
  gpio__construct_with_function(GPIO__PORT_1, 1, GPIO__FUNCTION_4);
  // Setting up MISO
  gpio__construct_with_function(GPIO__PORT_1, 4, GPIO__FUNCTION_4);
  // Setting up *CS
  gpio__construct_with_function(GPIO__PORT_1, 10, GPIO__FUNCITON_0_IO_PIN);
  gpio__construct_as_output(GPIO__PORT_1, 10);

  // Fake *CS
  gpio__construct_with_function(GPIO__PORT_2, 0, GPIO__FUNCITON_0_IO_PIN);
  gpio__construct_as_output(GPIO__PORT_2, 0);
}

void spi_task(void *p) {
  const uint32_t spi_clock_mhz = 1; // Setting clock to 1 MHz to see the waveform generation (as suggested by Preet)
  spi__init(spi_clock_mhz);

  // From the LPC schematics pdf, find the pin numbers connected to flash memory
  // Read table 84 from LPC User Manual and configure PIN functions for SPI2 pins
  // You can use gpio__construct_with_function() API from gpio.h
  //
  // Note: Configure only SCK2, MOSI2, MISO2.
  // CS will be a GPIO output pin(configure and setup direction)
  todo_configure_your_spi_pin_functions();

  while (1) {
    adesto_flash_id_s id = adesto_read_signature();
    // TODO: printf the members of the 'adesto_flash_id_s' struct

    printf("\nManufacturer ID: %x\nDevice ID_1: %x\nDevice ID_2: %x\nExtended Device ID: %x\n", id.manufacturer_id,
           id.device_id_1, id.device_id_2, id.extended_device_id);

    vTaskDelay(500);
  }
}

void main(void) {
  xTaskCreate(spi_task, "SPI_TASK", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  vTaskStartScheduler();
}

#endif

