JessePham/CMPE146_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
/*================== Lab 04 ADC + PWN ==================*/
#if 0
// Lab 4.2

#include "adc.h"
#include "pwm1.h"

#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"
#include <stdio.h>

// This is the queue handle we will need for the xQueue Send/Receive API
static QueueHandle_t adc_to_pwm_task_queue;

void pin_configure_adc_channel_as_io_pin(void) {
  LPC_IOCON->P1_31 &= ~(7 << 0);
  LPC_IOCON->P1_31 |= (3 << 0);
  LPC_IOCON->P1_31 &= ~(3 << 3);
  LPC_IOCON->P1_31 |= (1 << 3);
  LPC_IOCON->P1_31 &= ~(1 << 7);
}

void adc_task(void *p) {
  // NOTE: Reuse the code from Part 1

  int adc_reading = 0; // Note that this 'adc_reading' is not the same variable as the one from adc_task

  adc__initialize();
  adc__enable_burst_mode();
  pin_configure_adc_channel_as_io_pin(); // You need to write this function

  while (1) {

    adc_reading = adc__get_channel_reading_with_burst_mode(ADC__CHANNEL_5);
    if (xQueueSend(adc_to_pwm_task_queue, &adc_reading, 100)) {
      fprintf(stderr, "Voltage: %.3fV\nADC: %d\n", ((adc_reading * 3.3) / 4096), adc_reading);
    } else {
      puts("Nothing Sent");
    }

    vTaskDelay(100);
  }
}

void pin_configure_pwm_channel_as_io_pin() {
  LPC_IOCON->P2_0 &= ~(7 << 0);
  LPC_IOCON->P2_0 |= (1 << 0);
  LPC_IOCON->P2_1 &= ~(7 << 0);
  LPC_IOCON->P2_1 |= (1 << 0);
  LPC_IOCON->P2_2 &= ~(7 << 0);
  LPC_IOCON->P2_2 |= (1 << 0);
}

void pwm_task(void *p) {
  // NOTE: Reuse the code from Part 0
  int adc_reading = 0;

  pwm1__init_single_edge(1000);
  pin_configure_pwm_channel_as_io_pin();

  while (1) {
    // Implement code to receive potentiometer value from queue
    if (xQueueReceive(adc_to_pwm_task_queue, &adc_reading, 100)) {
      if (adc_reading <= 10) {
        pwm1__set_duty_cycle(PWM1__2_0, 0);
        pwm1__set_duty_cycle(PWM1__2_1, 0);
        pwm1__set_duty_cycle(PWM1__2_2, 0);
      } else if (adc_reading > 10 && adc_reading < 500) { // Red
        pwm1__set_duty_cycle(PWM1__2_0, adc_reading);
        pwm1__set_duty_cycle(PWM1__2_1, 0);
        pwm1__set_duty_cycle(PWM1__2_2, 0);
      } else if (adc_reading >= 500 && adc_reading < 1000) { // Magenta
        pwm1__set_duty_cycle(PWM1__2_0, 1000 - adc_reading);
        pwm1__set_duty_cycle(PWM1__2_1, 0);
        pwm1__set_duty_cycle(PWM1__2_2, adc_reading - 500);
      } else if (adc_reading >= 1000 && adc_reading < 1500) { // Blue
        pwm1__set_duty_cycle(PWM1__2_0, 0);
        pwm1__set_duty_cycle(PWM1__2_1, 0);
        pwm1__set_duty_cycle(PWM1__2_2, adc_reading);
      } else if (adc_reading >= 1500 && adc_reading < 2000) { // Teal
        pwm1__set_duty_cycle(PWM1__2_0, 0);
        pwm1__set_duty_cycle(PWM1__2_1, adc_reading - 1500);
        pwm1__set_duty_cycle(PWM1__2_2, 2000 - adc_reading);
      } else if (adc_reading >= 2000 && adc_reading < 2500) { // Green
        pwm1__set_duty_cycle(PWM1__2_0, 0);
        pwm1__set_duty_cycle(PWM1__2_1, adc_reading);
        pwm1__set_duty_cycle(PWM1__2_2, 0);
      } else if (adc_reading >= 2500 && adc_reading < 3500) { // Yellow
        pwm1__set_duty_cycle(PWM1__2_0, adc_reading - 2500);
        pwm1__set_duty_cycle(PWM1__2_1, adc_reading);
        pwm1__set_duty_cycle(PWM1__2_2, 0);
      } else if (adc_reading >= 3500 && adc_reading < 4000) { // White
        pwm1__set_duty_cycle(PWM1__2_0, adc_reading);
        pwm1__set_duty_cycle(PWM1__2_1, adc_reading);
        pwm1__set_duty_cycle(PWM1__2_2, adc_reading - 3500);
      }
    }
    // fprintf(stderr, "\nM0: %li\nM1: %li\nM2: %li\nM3: %li\n", LPC_PWM1->MR0, LPC_PWM1->MR1, LPC_PWM1->MR2,
    //         LPC_PWM1->MR3);
  }
}

void main(void) {
  // Queue will only hold 1 integer
  adc_to_pwm_task_queue = xQueueCreate(1, sizeof(int));

  xTaskCreate(adc_task, "ADC_Task", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  xTaskCreate(pwm_task, "PWM_Task", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  vTaskStartScheduler();
}
#endif

#if 0
// Lab 4.1

#include "adc.h"

#include "FreeRTOS.h"
#include "task.h"
#include <stdio.h>

void pin_configure_adc_channel_as_io_pin(void) {
  LPC_IOCON->P1_31 &= ~(7 << 0);
  LPC_IOCON->P1_31 |= (3 << 0);
  LPC_IOCON->P1_31 &= ~(3 << 3);
  LPC_IOCON->P1_31 |= (1 << 3);
  LPC_IOCON->P1_31 &= ~(1 << 7);
}

void adc_task(void *p) {
  adc__initialize();

  // This is the function you need to add to adc.h
  // You can configure burst mode for just the channel you are using
  adc__enable_burst_mode();

  // Configure a pin, such as P1.31 with FUNC 011 to route this pin as ADC channel 5
  // You can use gpio__construct_with_function() API from gpio.h
  pin_configure_adc_channel_as_io_pin(); // You need to write this function

  while (1) {
    // Get the ADC reading using adc__get_adc_value() and print it
    // TODO: You need to write the implementation of this function
    const uint16_t adc_value = adc__get_channel_reading_with_burst_mode(ADC__CHANNEL_5);

    fprintf(stderr, "%i\n", adc_value);

    vTaskDelay(100);
  }
}

void main(void) {
  xTaskCreate(adc_task, "ADC_Task", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  vTaskStartScheduler();
}

#endif

#if 0
// Lab 4.0
#include "pwm1.h"

#include "FreeRTOS.h"
#include "task.h"

void pin_configure_pwm_channel_as_io_pin() {
  LPC_IOCON->P2_0 &= ~(7 << 0);
  LPC_IOCON->P2_0 |= (1 << 0);
}

void pwm_task(void *p) {
  pwm1__init_single_edge(1000);

  // Locate a GPIO pin that a PWM channel will control
  // NOTE You can use gpio__construct_with_function() API from gpio.h
  // TODO Write this function yourself
  pin_configure_pwm_channel_as_io_pin();

  // We only need to set PWM configuration once, and the HW will drive
  // the GPIO at 1000Hz, and control set its duty cycle to 50%
  pwm1__set_duty_cycle(PWM1__2_0, 50);

  // Continue to vary the duty cycle in the loop
  uint8_t percent = 0;
  while (1) {
    pwm1__set_duty_cycle(PWM1__2_0, percent);

    if (++percent > 100) {
      percent = 0;
    }

    vTaskDelay(100);
  }
}

void main(void) {
  xTaskCreate(pwm_task, "PWM_Task", 4096 / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  vTaskStartScheduler();
}

#endif

