JessePham/CMPE146_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
  vTaskStartScheduler();
  return 0;
}

#endif

#if 0
// Lab 02 Part 3

typedef struct {
  uint8_t port;
  uint8_t pin;
} port_pin_s;

static SemaphoreHandle_t switch_press_indication;
static port_pin_s swch = {1, 19};

void led_task(void *task_parameter) {
  port_pin_s *led = (port_pin_s *)task_parameter;y;

  LPC_IOCON->P2_3 &= ~((1 << 4) | (1 << 2) | (1 << 1) | (1 << 0));
  gpio0__set_as_output(led->port, led->pin);

  while (true) {
    if (xSemaphoreTake(switch_press_indication, 1000)) {
      // TODO: Blink the LED
      while (gpio0__get_level(swch.port, swch.pin)) {
      }

      gpio0__set_high(led->port, led->pin);
      vTaskDelay(100);
      gpio0__set_low(led->port, led->pin);
      vTaskDelay(100);
    } else {
      puts("Timeout: No switch press indication for 1000ms");
    }
  }
}

void switch_task(void *task_parameter) {
  port_pin_s *sw = (port_pin_s *)task_parameter;

  LPC_IOCON->P1_19 &= ~((1 << 4) | (1 << 2) | (1 << 1) | (1 << 0));
  LPC_IOCON->P1_19 |= (1 << 3);
  gpio0__set_as_input(sw->port, sw->pin);

  while (true) {
    // TODO: If switch pressed, set the binary semaphore
    if (gpio0__get_level(sw->port, sw->pin)) {
      printf("Button Press\n");
      xSemaphoreGive(switch_press_indication);
    }
    vTaskDelay(100);
  }
}

int main(void) {
  switch_press_indication = xSemaphoreCreateBinary();

  // Hint: Use on-board LEDs first to get this logic to work
  //       After that, you can simply switch these parameters to off-board LED and a switch
  // external value: 1, 23
  static port_pin_s led = {2, 3}; // external value: 2, 4

  xTaskCreate(switch_task, "switch", 1024 / sizeof(void *), &swch, PRIORITY_LOW, NULL);
  xTaskCreate(led_task, "led", 1024 / sizeof(void *), &led, PRIORITY_LOW, NULL);

  vTaskStartScheduler();

  return 0;
}

#endif

#if 0
// Lab 02 Extra Credit

typedef struct {
  uint8_t port;
  uint8_t pin;
} port_pin_s;

static SemaphoreHandle_t switch_press_indication;

void led_task(void *task_parameter) {
  port_pin_s *led_arr = (port_pin_s *)task_parameter;

  LPC_IOCON->P2_3 &= ~(7 << 3);
  LPC_IOCON->P2_1 &= ~(7 << 3);
  LPC_IOCON->P2_2 &= ~(7 << 3);
  LPC_IOCON->P2_0 &= ~(7 << 3);

  for (int i = 0; i < 4; i++) {
    gpio0__set_as_output(led_arr[i].port, led_arr[i].pin);
  }

  while (true) {
    if (xSemaphoreTake(switch_press_indication, 1000)) {
      for (int i = 0; i < 4; i++) {
        gpio0__set_high(led_arr[i].port, led_arr[i].pin);
        vTaskDelay(100);
      }

      int stopper = 0;
      for (int j = 0; j < 4; j++) {
        for (int i = 3; i >= stopper; i--) {
          if (i < 3) {
            gpio0__set_low(led_arr[i + 1].port, led_arr[i + 1].pin);
          }
          gpio0__set_high(led_arr[i].port, led_arr[i].pin);
          vTaskDelay(200);
        }
        stopper++;
      }

      for (int i = 3; i >= 1; i--) {
        for (int k = 0; k < 2; k++) {
          gpio0__set_low(led_arr[0].port, led_arr[0].pin);
          vTaskDelay(100);
          gpio0__set_high(led_arr[0].port, led_arr[0].pin);
          vTaskDelay(100);
        }

        gpio0__set_low(led_arr[0].port, led_arr[0].pin);
        vTaskDelay(200);

        gpio0__set_low(led_arr[i].port, led_arr[i].pin);
        gpio0__set_high(led_arr[0].port, led_arr[0].pin);
        vTaskDelay(200);
      }

      // All Flash On and Off x2
      for (int j = 0; j < 2; j++) {
        for (int i = 0; i < 4; i++) {
          gpio0__set_low(led_arr[i].port, led_arr[i].pin);
        }
        vTaskDelay(300);
        for (int i = 0; i < 4; i++) {
          gpio0__set_high(led_arr[i].port, led_arr[i].pin);
        }
        vTaskDelay(300);
      }

      for (int i = 0; i < 4; i++) {
        gpio0__set_low(led_arr[i].port, led_arr[i].pin);
      }

      vTaskDelay(100);
    } else {
      puts("Timeout: No switch press indication for 1000ms");
    }
  }
}

void switch_task(void *task_parameter) {
  port_pin_s *sw = (port_pin_s *)task_parameter;

  LPC_IOCON->P1_23 &= ~((1 << 4) | (1 << 2) | (1 << 1) | (1 << 0));
  LPC_IOCON->P1_23 |= (1 << 3);
  gpio0__set_as_input(sw->port, sw->pin);

  while (true) {
    if (gpio0__get_level(sw->port, sw->pin)) {
      xSemaphoreGive(switch_press_indication);
    }
    vTaskDelay(500); // originally 100ms
  }
}

int main(void) {
  switch_press_indication = xSemaphoreCreateBinary();

  static port_pin_s sw = {1, 23};
  static port_pin_s led_arr[] = {{2, 4}, {2, 2}, {2, 1}, {2, 0}};

  xTaskCreate(switch_task, "switch", 1024 / sizeof(void *), &sw, PRIORITY_LOW, NULL);
  xTaskCreate(led_task, "led", 1024 / sizeof(void *), &led_arr, PRIORITY_LOW, NULL);

  vTaskStartScheduler();

  return 0;
}
#endif

#if 0
#include "FreeRTOS.h"
#include "gpio_lab.h"
#include "lpc40xx.h"
#include "semphr.h"
#include "stdbool.h"
#include "stdio.h"
#include "task.h"

//Lab 01 FreeRTOS Tasks
static void task_one(void *task_parameter);
static void task_two(void *task_parameter);

int main(void) {
  const uint32_t STACK_SIZE = 4096 / sizeof(void *);

  xTaskCreate(task_one, "TaskOneCode", STACK_SIZE, NULL, PRIORITY_HIGH, NULL);
  xTaskCreate(task_two, "TaskTwoCode", STACK_SIZE, NULL, PRIORITY_HIGH, NULL);

  vTaskStartScheduler();
}

static void task_one(void *task_parameter) {
  while (1) {
    // Read existing main.c regarding when we should use fprintf(stderr...) in place of printf()
    // For this lab, we will use fprintf(stderr, ...)
    fprintf(stderr, "AAAAAAAAAAAA");

    // Sleep for 100ms
    vTaskDelay(100);
  }
}

static void task_two(void *task_parameter) {
  while (1) {
    fprintf(stderr, "bbbbbbbbbbbb");
    vTaskDelay(100);
  }
}
#endif